# Pandas
1. It contains data structures and data manipulation tools designed to make data cleaning and analysis fast and easy in Python.
2. Pandas is designed for working with tabular or heterogeneous data. 
3. Data normalization and data transformation is also one of the key features of Pandas
4. NumPy, by contrast, is best suited for working with homogeneous numerical array data.

In [1]:
import pandas as pd

# Data-structures
There are two types of data structures:
1. Series
2. Data-Frame

## Series
It is a series of data (one-dimentional)

In [2]:
marks = pd.Series([60,80,39])

In [3]:
marks

0    60
1    80
2    39
dtype: int64

* For accessing indivisual data

In [4]:
marks[2]

39

In [5]:
marks[0]

60

* Can also specify the index

In [6]:
marks = pd.Series([60,80,39],index=['Ali','Aima','Ahsan'])

In [7]:
marks

Ali      60
Aima     80
Ahsan    39
dtype: int64

In [8]:
marks['Ali']

60

* Fancy indexing

In [9]:
marks[['Aima','Ahsan']]

Aima     80
Ahsan    39
dtype: int64

*  Can also specify data type

In [10]:
marks = pd.Series([60,80,39],index=['Ali','Aima','Ahsan'],dtype='float')

In [11]:
marks

Ali      60.0
Aima     80.0
Ahsan    39.0
dtype: float64

* Filtering

In [12]:
marks[marks > 55]

Ali     60.0
Aima    80.0
dtype: float64

* To get the values out of the array

In [13]:
marks.values

array([60., 80., 39.])

* Changing the value of indexes

In [14]:
marks['Ali'] = 23

In [15]:
marks

Ali      23.0
Aima     80.0
Ahsan    39.0
dtype: float64

#### Creating Series by dictionary

* "Qasim" will be the index and "30" will be its value

In [16]:
age = pd.Series({'Qasim':30,'Rafiq':28,'Shahid':18})
age

Qasim     30
Rafiq     28
Shahid    18
dtype: int64

* To check the value which is null

In [17]:
age = pd.Series({'Qasim':30,'Rafiq':None,'Shahid':18})
age

Qasim     30.0
Rafiq      NaN
Shahid    18.0
dtype: float64

In [18]:
pd.isnull(age)

Qasim     False
Rafiq      True
Shahid    False
dtype: bool

In [19]:
age.mean()

24.0

#### Comman Maths with series

In [20]:
age2 = pd.Series([40,70],index=['Shahid','Qasim'])

In [21]:
age + age2

Qasim     100.0
Rafiq       NaN
Shahid     58.0
dtype: float64

In [22]:
age * age2

Qasim     2100.0
Rafiq        NaN
Shahid     720.0
dtype: float64

In [23]:
age / age2

Qasim     0.428571
Rafiq          NaN
Shahid    0.450000
dtype: float64

In [24]:
age3 = pd.Series([50,80],index=['Shahid','Rafiq'])

In [25]:
age+age3

Qasim      NaN
Rafiq      NaN
Shahid    68.0
dtype: float64

## Dataframes Or Tabular Data
* They are two dimentional data structues
* Widely used

In [26]:
patients = pd.DataFrame({
    'Names' : ['Ahmer','Irshad','Fatimah'],
    'Age' : [32,18,28],
    'Resident' : ['Islamabad','Karachi','Lahore'],
    'Ward' : ['Cardio','Cardio','Comman']
})

In [27]:
patients

     Names  Age   Resident    Ward
0    Ahmer   32  Islamabad  Cardio
1   Irshad   18    Karachi  Cardio
2  Fatimah   28     Lahore  Comman

## Taking Information out of a Dataframe

By square bracket [ ] method

In [28]:
patients.columns

Index(['Names', 'Age', 'Resident', 'Ward'], dtype='object')

In [29]:
patients['Names']

0      Ahmer
1     Irshad
2    Fatimah
Name: Names, dtype: object

In [30]:
patients['Age']

0    32
1    18
2    28
Name: Age, dtype: int64

In [31]:
patients['Ward']

0    Cardio
1    Cardio
2    Comman
Name: Ward, dtype: object

#### Simpler Method

In [32]:
patients.Names

0      Ahmer
1     Irshad
2    Fatimah
Name: Names, dtype: object

In [33]:
patients.Age

0    32
1    18
2    28
Name: Age, dtype: int64

#### For a specific value

In [34]:
patients.Age[1]

18

In [35]:
patients.Names[2]

'Fatimah'

#### For Multiple Columns

In [36]:
patients[['Ward','Names']]

     Ward    Names
0  Cardio    Ahmer
1  Cardio   Irshad
2  Comman  Fatimah

#### Applying Conditions

In [37]:
patients[patients['Age']>25]

     Names  Age   Resident    Ward
0    Ahmer   32  Islamabad  Cardio
2  Fatimah   28     Lahore  Comman

#### If we want to get the highest value
In this case we have age

In [38]:
patients['Age'].max()

32

#### If we want to get the highest value

In [39]:
patients['Age'].min()

18

#### If we want to get the "Index" of the highest value
In this case we have "Age"

In [40]:
patients['Age'].idxmax()

0

#### If we want to get the "Index" of the Lowest value

In [41]:
patients['Age'].idxmin()

1

* The cons of getting index is, that we can than use it to get the whole record of the index!

In [42]:
ind = patients['Age'].idxmax()

In [43]:
patients.loc[ind]

Names           Ahmer
Age                32
Resident    Islamabad
Ward           Cardio
Name: 0, dtype: object

## Adding a new column in a pre-exsisting dataframe
####  Using "Numpy"
* First We have to import "Numpy"

In [44]:
import numpy as np

In [45]:
patients

     Names  Age   Resident    Ward
0    Ahmer   32  Islamabad  Cardio
1   Irshad   18    Karachi  Cardio
2  Fatimah   28     Lahore  Comman

In [46]:
patients['Date of Admission'] = np.array(['14-01-2023','28-01-2023','15-02-2023'])

In [47]:
patients

     Names  Age   Resident    Ward Date of Admission
0    Ahmer   32  Islamabad  Cardio        14-01-2023
1   Irshad   18    Karachi  Cardio        28-01-2023
2  Fatimah   28     Lahore  Comman        15-02-2023

* Using arange()

In [48]:
patients['Admission order'] = np.arange(1,4)

In [49]:
patients

     Names  Age   Resident    Ward Date of Admission  Admission order
0    Ahmer   32  Islamabad  Cardio        14-01-2023                1
1   Irshad   18    Karachi  Cardio        28-01-2023                2
2  Fatimah   28     Lahore  Comman        15-02-2023                3

#### By Pandas it-self
But this is not a very Efficient Method

In [50]:
patients['Hospital Branch'] = 'Karachi'
patients

,Names,Age,Resident,Ward,Date of Admission,Admission order,Hospital Branch
0,Ahmer,32,Islamabad,Cardio,14-01-2023,1,Karachi
1,Irshad,18,Karachi,Cardio,28-01-2023,2,Karachi
2,Fatimah,28,Lahore,Comman,15-02-2023,3,Karachi

## Specifing Index / Custom Indexing

In [51]:
stds = pd.DataFrame({
    'Names':['Abdul Jabbar','Moiz','Rahim','Maryam','Rimsha'],
    'Age':[19,18,18,19,18],
    'Faculty':['Electrical','Software','Electrical','Mechanical','Automotive']
},index=['NED1','NED2','NED3','NED4','NED5'])

In [52]:
stds

             Names  Age     Faculty
NED1  Abdul Jabbar   19  Electrical
NED2          Moiz   18    Software
NED3         Rahim   18  Electrical
NED4        Maryam   19  Mechanical
NED5        Rimsha   18  Automotive

## Accessing Data Row Wise

In [53]:
stds.loc['NED2']

Names          Moiz
Age              18
Faculty    Software
Name: NED2, dtype: object

* "loc" is use to accessing data through index

In [54]:
stds.loc['NED5']

Names          Rimsha
Age                18
Faculty    Automotive
Name: NED5, dtype: object

* "iloc" is use to accessing the data by specifying the data location

In [55]:
stds.iloc[2]

Names           Rahim
Age                18
Faculty    Electrical
Name: NED3, dtype: object

In [56]:
stds.iloc[3]

Names          Maryam
Age                19
Faculty    Mechanical
Name: NED4, dtype: object

## Deleting Columns

In [57]:
stds

             Names  Age     Faculty
NED1  Abdul Jabbar   19  Electrical
NED2          Moiz   18    Software
NED3         Rahim   18  Electrical
NED4        Maryam   19  Mechanical
NED5        Rimsha   18  Automotive

In [58]:
del stds['Names']

In [59]:
stds

      Age     Faculty
NED1   19  Electrical
NED2   18    Software
NED3   18  Electrical
NED4   19  Mechanical
NED5   18  Automotive

## Transpose

In [60]:
stds.T

               NED1      NED2        NED3        NED4        NED5
Age              19        18          18          19          18
Faculty  Electrical  Software  Electrical  Mechanical  Automotive

## Slicing in Dataframe

* Slicing in data frame can be done by just mentioning the the required column or row name in square brackets "[ ]"
* But it can also be done by "iloc" method. Just mention the " .iloc " after the dataframe name and before the square brackets (This is more efficient method)
* Can use "iloc" (but it will not work with custom label). Meanwhile using "loc" provides more control over fancy labels and default labels
* For Slicing always have to mention "start, end and steps"

In [61]:
patients

,Names,Age,Resident,Ward,Date of Admission,Admission order,Hospital Branch
0,Ahmer,32,Islamabad,Cardio,14-01-2023,1,Karachi
1,Irshad,18,Karachi,Cardio,28-01-2023,2,Karachi
2,Fatimah,28,Lahore,Comman,15-02-2023,3,Karachi

#### For Row-wise Slicing

In [62]:
patients.loc[::2]

,Names,Age,Resident,Ward,Date of Admission,Admission order,Hospital Branch
0,Ahmer,32,Islamabad,Cardio,14-01-2023,1,Karachi
2,Fatimah,28,Lahore,Comman,15-02-2023,3,Karachi

In [63]:
patients.loc[::]['Names']

0      Ahmer
1     Irshad
2    Fatimah
Name: Names, dtype: object

#### For column-wise Slicing

In [64]:
patients.loc[:,'Names':'Ward']

     Names  Age   Resident    Ward
0    Ahmer   32  Islamabad  Cardio
1   Irshad   18    Karachi  Cardio
2  Fatimah   28     Lahore  Comman

## Converting Dataframe into a "Numpy" Array

In [65]:
patients.values

array([['Ahmer', 32, 'Islamabad', 'Cardio', '14-01-2023', 1, 'Karachi'],
       ['Irshad', 18, 'Karachi', 'Cardio', '28-01-2023', 2, 'Karachi'],
       ['Fatimah', 28, 'Lahore', 'Comman', '15-02-2023', 3, 'Karachi']],
      dtype=object)

In [66]:
stds.values

array([[19, 'Electrical'],
       [18, 'Software'],
       [18, 'Electrical'],
       [19, 'Mechanical'],
       [18, 'Automotive']], dtype=object)

## Dropping

".drop()" is not an "in-place/in-memory"  operation. It means that by using "drop()" it will not effect the the original dataframe or in simpler words it will not save in the memory

In [67]:
patients

,Names,Age,Resident,Ward,Date of Admission,Admission order,Hospital Branch
0,Ahmer,32,Islamabad,Cardio,14-01-2023,1,Karachi
1,Irshad,18,Karachi,Cardio,28-01-2023,2,Karachi
2,Fatimah,28,Lahore,Comman,15-02-2023,3,Karachi

#### Row wise dropping

In [68]:
patients.drop([0],axis=0)

,Names,Age,Resident,Ward,Date of Admission,Admission order,Hospital Branch
1,Irshad,18,Karachi,Cardio,28-01-2023,2,Karachi
2,Fatimah,28,Lahore,Comman,15-02-2023,3,Karachi

#### Column wise dropping

In [69]:
patients

,Names,Age,Resident,Ward,Date of Admission,Admission order,Hospital Branch
0,Ahmer,32,Islamabad,Cardio,14-01-2023,1,Karachi
1,Irshad,18,Karachi,Cardio,28-01-2023,2,Karachi
2,Fatimah,28,Lahore,Comman,15-02-2023,3,Karachi

In [70]:
patients.drop(['Date of Admission','Admission order'],axis=1)

     Names  Age   Resident    Ward Hospital Branch
0    Ahmer   32  Islamabad  Cardio         Karachi
1   Irshad   18    Karachi  Cardio         Karachi
2  Fatimah   28     Lahore  Comman         Karachi

* But we can save "drop()" value in the memory "Manually"

In [71]:
patients.drop(['Date of Admission','Admission order'],axis=1,inplace=True)

In [72]:
patients

     Names  Age   Resident    Ward Hospital Branch
0    Ahmer   32  Islamabad  Cardio         Karachi
1   Irshad   18    Karachi  Cardio         Karachi
2  Fatimah   28     Lahore  Comman         Karachi

## Converting Numpy Array into Dataframe

In [73]:
arr = np.array([
    ['Kareem', 23, 'Rawalpindi', 'Medical'],
    ['Shahid', 24, 'Faisalabad', 'Commerce'],
    ['Jameel', 20, 'Thatta', 'Engineering']
])

In [74]:
pd.DataFrame(arr)

        0   1           2            3
0  Kareem  23  Rawalpindi      Medical
1  Shahid  24  Faisalabad     Commerce
2  Jameel  20      Thatta  Engineering

* for mentioning the columns

In [75]:
stds = pd.DataFrame(arr,columns=['Name','Age','City','Field'])

In [76]:
stds

     Name Age        City        Field
0  Kareem  23  Rawalpindi      Medical
1  Shahid  24  Faisalabad     Commerce
2  Jameel  20      Thatta  Engineering

## Making Dataframe by List

In [77]:
list =[
    ['Kareem', 23, 'Rawalpindi', 'Medical'],
    ['Shahid', 24, 'Faisalabad', 'Commerce'],
    ['Jameel', 20, 'Thatta', 'Engineering']
]

In [78]:
stds = pd.DataFrame(list)

In [79]:
stds

        0   1           2            3
0  Kareem  23  Rawalpindi      Medical
1  Shahid  24  Faisalabad     Commerce
2  Jameel  20      Thatta  Engineering

In [80]:
stds = pd.DataFrame(list,columns=['Name','Age','City','Feculty'])

In [81]:
stds

     Name  Age        City      Feculty
0  Kareem   23  Rawalpindi      Medical
1  Shahid   24  Faisalabad     Commerce
2  Jameel   20      Thatta  Engineering

## Applying  Functions

#### Simple Functions

In [82]:
def calc_sum(x):
    return x.sum()

In [83]:
data = {
  "x": [50, 40, 30],
  "y": [300, 1112, 42]
}

In [84]:
df = pd.DataFrame(data)

In [85]:
x = df.apply(calc_sum)

In [86]:
print(x)

x     120
y    1454
dtype: int64

#### Complex Funtions

In [87]:
frame = pd.DataFrame({
    'Name':['Rehbar','Nashrah','Bilal','Khadim'],
    'Age':[40,45,30,35],
    'CGPA':[3.5,4.0,3.9,4.1],
    'City':['Karachi','Rawalpindi','Sialkot','Peshwar'],
    'Semister':[2,3,3,4]
})

In [88]:
frame

      Name  Age  CGPA        City  Semister
0   Rehbar   40   3.5     Karachi         2
1  Nashrah   45   4.0  Rawalpindi         3
2    Bilal   30   3.9     Sialkot         3
3   Khadim   35   4.1     Peshwar         4

In [89]:
def old_young(age):
    if(age > 35):
        return 'Old'
    else:
        return 'Young'

In [90]:
frame['Status']=frame['Age'].apply(old_young)

In [91]:
frame

      Name  Age  CGPA        City  Semister Status
0   Rehbar   40   3.5     Karachi         2    Old
1  Nashrah   45   4.0  Rawalpindi         3    Old
2    Bilal   30   3.9     Sialkot         3  Young
3   Khadim   35   4.1     Peshwar         4  Young

#### Lambda Functions
* They are one line functions
* They don't have names

In [92]:
old_young = lambda age: "Old" if age>35 else "Young"

In [93]:
frame['Status']=frame['Age'].apply(old_young)

In [94]:
frame

      Name  Age  CGPA        City  Semister Status
0   Rehbar   40   3.5     Karachi         2    Old
1  Nashrah   45   4.0  Rawalpindi         3    Old
2    Bilal   30   3.9     Sialkot         3  Young
3   Khadim   35   4.1     Peshwar         4  Young

#### Lambda Functions in depth

In [95]:
employee = pd.DataFrame({
    'Salary':[2000,3000,2500,4000],
    'Name':['Rashid','Rehan','Karim','Aahd']
})
employee

   Salary    Name
0    2000  Rashid
1    3000   Rehan
2    2500   Karim
3    4000    Aahd

In [96]:
employee['Increment']=employee['Salary'].apply(lambda Salary: 50 if Salary<=2500 else 25)

In [97]:
employee

   Salary    Name  Increment
0    2000  Rashid         50
1    3000   Rehan         25
2    2500   Karim         50
3    4000    Aahd         25

## Applying Numpy Functions

Can apply almost all "Numpy" functions on "Pandas"

In [98]:
np.abs(employee['Increment'])

0    50
1    25
2    50
3    25
Name: Increment, dtype: int64

In [99]:
np.mean(employee['Increment'])

37.5

In [100]:
np.sqrt(employee['Increment'])

0    7.071068
1    5.000000
2    7.071068
3    5.000000
Name: Increment, dtype: float64

## Comman Pandas Functions

In [101]:
psl = pd.DataFrame({
    'Teams':['Peshawar','Islamabad','Quetta','Karachi','Lahore','Multan'],
    'Matches':[8,8,8,8,8,8],
    'Win':[6,6,5,4,2,1],
    'Loss':[2,2,3,4,6,7],
    'NRR':[2.550,1.861,0.347,0.002,-0.012,-0.001],
    'Points':[12,12,10,8,4,2]
},index=[1,2,3,4,5,6])

In [102]:
psl

       Teams  Matches  Win  Loss    NRR  Points
1   Peshawar        8    6     2  2.550      12
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4
6     Multan        8    1     7 -0.001       2

#### For Displaying Starting lines
"head()" is used to display the top five rows of a "Dataframe"

In [103]:
psl.head()

       Teams  Matches  Win  Loss    NRR  Points
1   Peshawar        8    6     2  2.550      12
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4

* Can also specify the numbers of rows you want to display

In [104]:
psl.head(2)

       Teams  Matches  Win  Loss    NRR  Points
1   Peshawar        8    6     2  2.550      12
2  Islamabad        8    6     2  1.861      12

#### For displaying the end lines
"Tail()" is used to display the end five rows of a "Dataframe"

In [105]:
psl.tail()

       Teams  Matches  Win  Loss    NRR  Points
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4
6     Multan        8    1     7 -0.001       2

* Can also mention the numbers of rows you want to display

In [106]:
psl.tail(3)

     Teams  Matches  Win  Loss    NRR  Points
4  Karachi        8    4     4  0.002       8
5   Lahore        8    2     6 -0.012       4
6   Multan        8    1     7 -0.001       2

#### Converting data type
The "NRR" value is in "float", we can convert it into other data type

In [107]:
psl['NRR']

1    2.550
2    1.861
3    0.347
4    0.002
5   -0.012
6   -0.001
Name: NRR, dtype: float64

In [108]:
psl['NRR'].astype('object')

1     2.55
2    1.861
3    0.347
4    0.002
5   -0.012
6   -0.001
Name: NRR, dtype: object

In [109]:
psl['NRR'].astype('int')

1    2
2    1
3    0
4    0
5    0
6    0
Name: NRR, dtype: int32

## Descriptive Statistics of a Dataframe

In [110]:
fr = pd.DataFrame({
    'std_code1':[1867,8895,6153],
    'std_code2':[7514,3546,8431]
})

In [111]:
fr

   std_code1  std_code2
0       1867       7514
1       8895       3546
2       6153       8431

#### ".describe()" Function
* It gives a varity of knowledge about the dataframe

In [112]:
psl.describe()

       Matches       Win      Loss       NRR     Points
count      6.0  6.000000  6.000000  6.000000   6.000000
mean       8.0  4.000000  4.000000  0.791167   8.000000
std        0.0  2.097618  2.097618  1.125230   4.195235
min        8.0  1.000000  2.000000 -0.012000   2.000000
25%        8.0  2.500000  2.250000 -0.000250   5.000000
50%        8.0  4.500000  3.500000  0.174500   9.000000
75%        8.0  5.750000  5.500000  1.482500  11.500000
max        8.0  6.000000  7.000000  2.550000  12.000000

#### ".sum()" Function

In [113]:
fr.sum()

std_code1    16915
std_code2    19491
dtype: int64

#### ".cumsum()" Function

* Cumlative sum of values

In [114]:
fr.cumsum()

   std_code1  std_code2
0       1867       7514
1      10762      11060
2      16915      19491

#### ".count()" Function
* Number of non-NA values

In [115]:
fr.count()

std_code1    3
std_code2    3
dtype: int64

#### ".min()/.max()" Function
* Compute minimum and maximum values

In [116]:
fr.min()

std_code1    1867
std_code2    3546
dtype: int64

In [117]:
fr.max()

std_code1    8895
std_code2    8431
dtype: int64

#### ".argmin()/.argmax()" Function
* Compute index locations (intigers) in which minimum or maximum value obtained, respectively

In [118]:
np.argmin(fr)

0

In [119]:
np.argmax(fr)

2

#### ".quantile()" Function
* Compute sample quantile from 0 to 1

In [120]:
fr.quantile()

std_code1    6153.0
std_code2    7514.0
Name: 0.5, dtype: float64

#### ".mean()" Function

In [121]:
fr.mean()

std_code1    5638.333333
std_code2    6497.000000
dtype: float64

".median()" Function
* Airthmetic median (50% quantile) of values

In [122]:
fr.median()

std_code1    6153.0
std_code2    7514.0
dtype: float64

#### ".mad()" Function
* Mean absolute deviation from mean value

In [123]:
fr.mad()

std_code1    2514.222222
std_code2    1967.333333
dtype: float64

#### ".prod()" Function
* Product of values

In [124]:
fr.prod()

std_code1    102182655645
std_code2    224640993564
dtype: int64

#### ".var()" Function
* Sample variance of values

In [125]:
fr.var()

std_code1    1.254686e+07
std_code2    6.741523e+06
dtype: float64

#### ".std()" Function
* Sample standard deviation of values

In [126]:
fr.std()

std_code1    3542.154335
std_code2    2596.444299
dtype: float64

#### ".skew()" Function
* Sample skewness (third moment) of value

In [127]:
fr.skew()

std_code1   -0.640036
std_code2   -1.492183
dtype: float64

#### ".kurt()" Function
* Sample kurtosis (fourth moment) of values

In [128]:
fr.kurt()

std_code1   NaN
std_code2   NaN
dtype: float64

#### ".cummin()/.cummax()" Function
* Cummulative minimum or maximum of values, respectively

In [129]:
fr.cummin()

   std_code1  std_code2
0       1867       7514
1       1867       3546
2       1867       3546

In [130]:
fr.cummax()

   std_code1  std_code2
0       1867       7514
1       8895       7514
2       8895       8431

#### ".cumprod()" Function
* Cummulative product o values

In [131]:
fr.cumprod()

      std_code1     std_code2
0          1867          7514
1      16606965      26644644
2  102182655645  224640993564

#### ".diff()" Function
* Compute first arithmetic difference (useful for time series)

In [132]:
fr.diff()

   std_code1  std_code2
0        NaN        NaN
1     7028.0    -3968.0
2    -2742.0     4885.0

#### ".pct_change()" Function
* Compute percentage changes

In [133]:
fr.pct_change()

   std_code1  std_code2
0        NaN        NaN
1   3.764328  -0.528081
2  -0.308263   1.377609

## Saving "DataFrame" Into "CSV" File

In [134]:
psl

       Teams  Matches  Win  Loss    NRR  Points
1   Peshawar        8    6     2  2.550      12
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4
6     Multan        8    1     7 -0.001       2

In [135]:
psl.to_csv('PSL Ranking Chart.csv')

# Reading Data in Pandas
There are various type of data that pandas can read, but I am just showing the methods of two data types

## Reading The "CSV" File

This method is widely use in "Machine Learning"

In [136]:
match = pd.read_csv('PSL Ranking Chart.csv')

In [137]:
match

   Unnamed: 0      Teams  Matches  Win  Loss    NRR  Points
0           1   Peshawar        8    6     2  2.550      12
1           2  Islamabad        8    6     2  1.861      12
2           3     Quetta        8    5     3  0.347      10
3           4    Karachi        8    4     4  0.002       8
4           5     Lahore        8    2     6 -0.012       4
5           6     Multan        8    1     7 -0.001       2

While reading a "csv file" it generates an another index row "Unnamed:0", we can skip this by specifying index

In [138]:
match = pd.read_csv('PSL Ranking Chart.csv',index_col=0)

In [139]:
match

       Teams  Matches  Win  Loss    NRR  Points
1   Peshawar        8    6     2  2.550      12
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4
6     Multan        8    1     7 -0.001       2

#### Skipping the "Header"
This method is use for finding a certain column in a very large spreadsheet

In [140]:
match = pd.read_csv('PSL Ranking Chart.csv',index_col=0,header=None)
display(match)

             1        2    3     4       5       6
0
NaN      Teams  Matches  Win  Loss     NRR  Points
1.0   Peshawar        8    6     2    2.55      12
2.0  Islamabad        8    6     2   1.861      12
3.0     Quetta        8    5     3   0.347      10
4.0    Karachi        8    4     4   0.002       8
5.0     Lahore        8    2     6  -0.012       4
6.0     Multan        8    1     7  -0.001       2

#### Specifying Index by using Column(which is present in the DataFrame)!
Can also make index of a column present in the DataFrame.

In [141]:
pd.read_csv('PSL Ranking Chart.csv', index_col='NRR')

        Unnamed: 0      Teams  Matches  Win  Loss  Points
NRR
 2.550           1   Peshawar        8    6     2      12
 1.861           2  Islamabad        8    6     2      12
 0.347           3     Quetta        8    5     3      10
 0.002           4    Karachi        8    4     4       8
-0.012           5     Lahore        8    2     6       4
-0.001           6     Multan        8    1     7       2

#### Skipping the Unwanted rows of DataFrame!
Can also skip the rows that are unwanted.

In [142]:
pd.read_csv('PSL Ranking Chart.csv', skiprows=[0,2,5])

   1 Peshawar  8  6  2   2.55  12
0  3   Quetta  8  5  3  0.347  10
1  4  Karachi  8  4  4  0.002   8
2  6   Multan  8  1  7 -0.001   2

#### Custom "Null" Values!
We can also adjust a costum value for null! For example, there a some values in the DataFrame that you want to show "Null". Such as in the "PSL Ranking Chart.csv" there is a column of "Matches" according to which all the teams have played "8" matches if I want to nullify the "Matches" I just have to mention that "8 = N/A"!

In [143]:
pd.read_csv('PSL Ranking Chart.csv', na_values = 8)

   Unnamed: 0      Teams  Matches  Win  Loss    NRR  Points
0           1   Peshawar      NaN    6     2  2.550    12.0
1           2  Islamabad      NaN    6     2  1.861    12.0
2           3     Quetta      NaN    5     3  0.347    10.0
3           4    Karachi      NaN    4     4  0.002     NaN
4           5     Lahore      NaN    2     6 -0.012     4.0
5           6     Multan      NaN    1     7 -0.001     2.0

* Can also do this for the multiple Values! But it will not be very suitable for large scale data handeling!

In [144]:
pd.read_csv('PSL Ranking Chart.csv', na_values = [2,'Islamabad',6])

   Unnamed: 0     Teams  Matches  Win  Loss    NRR  Points
0         1.0  Peshawar        8  NaN   NaN  2.550    12.0
1         NaN       NaN        8  NaN   NaN  1.861    12.0
2         3.0    Quetta        8  5.0   3.0  0.347    10.0
3         4.0   Karachi        8  4.0   4.0  0.002     8.0
4         5.0    Lahore        8  NaN   NaN -0.012     4.0
5         NaN    Multan        8  1.0   7.0 -0.001     NaN

* Can Also Mention Multiple Columns! Suitable for large scale data handeling!

In [145]:
null = {'Teams':'Islamabad', 'Win':6, 'Matches':8, 'NRR': [2.550,-0.012] }

In [146]:
pd.read_csv('PSL Ranking Chart.csv', na_values = null)

   Unnamed: 0     Teams  Matches  Win  Loss    NRR  Points
0           1  Peshawar      NaN  NaN     2    NaN      12
1           2       NaN      NaN  NaN     2  1.861      12
2           3    Quetta      NaN  5.0     3  0.347      10
3           4   Karachi      NaN  4.0     4  0.002       8
4           5    Lahore      NaN  2.0     6    NaN       4
5           6    Multan      NaN  1.0     7 -0.001       2

## Reading The Excel File

In [147]:
info = pd.read_excel('PSL Chart.xlsx',index_col=0)

In [148]:
info

       Teams  Matches  Win  Loss    NRR  Points
1   Peshawar        8    6     2  2.550      12
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4
6     Multan        8    1     7 -0.001       2

## Filtering Out Missing Values

In [149]:
frame = pd.read_csv('frame.csv',index_col=0)

In [150]:
frame.columns=['Name','Age','Profession','Income','Job Site','Experience','Residence']
frame

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN

In [151]:
frame.isna()

    Name    Age  Profession  Income  Job Site  Experience  Residence
0  False  False       False   False     False       False      False
1  False  False       False   False     False       False      False
2  False  False       False   False     False       False      False
3  False  False       False   False     False       False       True
4  False  False       False   False     False       False      False
5  False  False       False   False     False       False       True

In [152]:
frame.isna().sum()

Name          0
Age           0
Profession    0
Income        0
Job Site      0
Experience    0
Residence     2
dtype: int64

#### To check which values are not null

In [153]:
(~frame.isna()).sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of    Name   Age  Profession  Income  Job Site  Experience  Residence
0  True  True        True    True      True        True       True
1  True  True        True    True      True        True       True
2  True  True        True    True      True        True       True
3  True  True        True    True      True        True      False
4  True  True        True    True      True        True       True
5  True  True        True    True      True        True      False>

#### Taking values out of it

In [154]:
frame[frame['Income']==40000]

    Name  Age   Profession  Income  Job Site  Experience Residence
1  Imran    0  Constructor   40000  Shipyard          10  Hongkong

In [155]:
frame[frame['Residence'].isna()]

,Name,Age,Profession,Income,Job Site,Experience,Residence
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN

#### Filling the 'Nan' slot for a single column

In [156]:
frame['Residence'].fillna(0)

0       U.S.A
1    Hongkong
2     England
3           0
4      France
5           0
Name: Residence, dtype: object

In [157]:
frame[frame['Residence'].isna()]

,Name,Age,Profession,Income,Job Site,Experience,Residence
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN

#### Filling 'Nan' slot for all over the dataframe

* Most of the "Nan" related functions are "not inplace" and can be inplace by 'inplace=True' but the following function is "inplace" function by default!

In [158]:
frame.fillna(0,inplace=False)

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,0
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,0

In [159]:
frame

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN

#### Filling  "Nan" slot by the above data
* The slots which contains "Nan" will take the value of the above slot!
* "ffill" means forward fill.

In [160]:
frame.fillna(method="ffill")

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,England
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,France

* Can also metion the limit, so after reaching the limit it will not proceed further "Forward Filling"!

In [161]:
frame.fillna(method="ffill",limit=1)

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,England
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,France

#### Dropping "Nan"
* It drops the entire row which has "Nan" Value

In [162]:
frame.dropna()

     Name  Age           Profession  Income     Job Site  Experience Residence
0  Kashif   63  Mechanical Engineer   55000  Freelancing           5     U.S.A
1   Imran    0          Constructor   40000     Shipyard          10  Hongkong
2       0   38            Insructor   10000          Gym           4   England
4  Shafiq   58                    0       0      Airport           8    France

#### Applying Conditions For Dropping
* Condion for dropping can be apply by using "how"
* If we do "how=all" it will not drop the row until all of the row is "Nan"

In [163]:
frame.dropna(how='all')

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN

#### Applying Threshold Condition
* Threshold is also a function by which we can apply a certain condition of skipping "NA" rows!
* In the code line below, "thresh=1" means the function will not drop "NA" there is atleast one column without "NA" in a single row. If the row only consist of "NA" then it will drop!

In [164]:
frame.dropna(thresh=1)

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN

* Now it will drop!

In [165]:
frame.dropna(thresh=7)

     Name  Age           Profession  Income     Job Site  Experience Residence
0  Kashif   63  Mechanical Engineer   55000  Freelancing           5     U.S.A
1   Imran    0          Constructor   40000     Shipyard          10  Hongkong
2       0   38            Insructor   10000          Gym           4   England
4  Shafiq   58                    0       0      Airport           8    France

* We can also mention the axis!

In [166]:
frame.dropna(thresh=5,axis=1)

,Name,Age,Profession,Income,Job Site,Experience
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5
1,Imran,0,Constructor,40000,Shipyard,10
2,0,38,Insructor,10000,Gym,4
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0
4,Shafiq,58,0,0,Airport,8
5,Danial,29,Racer,0,F1 Racing Arina,6

#### Dropping Duplicate Data
* Suppose there is same data in multiple slots then dropping them will make the DataFrame much easier to understand!
* To show the example of "Dropping Duplicate Data" I am using a DataFrame "info" which is in the beginning of this "Jupyter File"!

In [167]:
info

       Teams  Matches  Win  Loss    NRR  Points
1   Peshawar        8    6     2  2.550      12
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4
6     Multan        8    1     7 -0.001       2

In [168]:
info.drop_duplicates('Points')

      Teams  Matches  Win  Loss    NRR  Points
1  Peshawar        8    6     2  2.550      12
3    Quetta        8    5     3  0.347      10
4   Karachi        8    4     4  0.002       8
5    Lahore        8    2     6 -0.012       4
6    Multan        8    1     7 -0.001       2

* By default it starts to search from top to bottom (Well it's a interpreted language) by which the first duplicate value remains but all the others are gone, To keep the last duplicate value,

In [169]:
info.drop_duplicates('Points',keep="last")

       Teams  Matches  Win  Loss    NRR  Points
2  Islamabad        8    6     2  1.861      12
3     Quetta        8    5     3  0.347      10
4    Karachi        8    4     4  0.002       8
5     Lahore        8    2     6 -0.012       4
6     Multan        8    1     7 -0.001       2

## Conerting Data-Frame to "Standard Read File"
First we have to import 'sys'

In [170]:
import sys

In [171]:
frame.to_csv(sys.stdout)

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,

## Mentioning Separator
Separator can be anything!

In [172]:
frame.to_csv(sys.stdout,sep='~')

~Name~Age~Profession~Income~Job Site~Experience~Residence
0~Kashif~63~Mechanical Engineer~55000~Freelancing~5~U.S.A
1~Imran~0~Constructor~40000~Shipyard~10~Hongkong
2~0~38~Insructor~10000~Gym~4~England
3~Moein~45~Heart Surgeon~60000~Itly National Hospital~0~
4~Shafiq~58~0~0~Airport~8~France
5~Danial~29~Racer~0~F1 Racing Arina~6~

In [173]:
frame.to_csv(sys.stdout,sep='*')

*Name*Age*Profession*Income*Job Site*Experience*Residence
0*Kashif*63*Mechanical Engineer*55000*Freelancing*5*U.S.A
1*Imran*0*Constructor*40000*Shipyard*10*Hongkong
2*0*38*Insructor*10000*Gym*4*England
3*Moein*45*Heart Surgeon*60000*Itly National Hospital*0*
4*Shafiq*58*0*0*Airport*8*France
5*Danial*29*Racer*0*F1 Racing Arina*6*

#### Tab Separated

In [174]:
frame.to_csv(sys.stdout,sep='\t')

	Name	Age	Profession	Income	Job Site	Experience	Residence
0	Kashif	63	Mechanical Engineer	55000	Freelancing	5	U.S.A
1	Imran	0	Constructor	40000	Shipyard	10	Hongkong
2	0	38	Insructor	10000	Gym	4	England
3	Moein	45	Heart Surgeon	60000	Itly National Hospital	0
4	Shafiq	58	0	0	Airport	8	France
5	Danial	29	Racer	0	F1 Racing Arina	6

## Applying Funtion on a Single or Specific column

#### Example # 1:

In [175]:
frame

,Name,Age,Profession,Income,Job Site,Experience,Residence
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong
2,0,38,Insructor,10000,Gym,4,England
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN
4,Shafiq,58,0,0,Airport,8,France
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN

* "x" in the code below is "any number"!
* Adding "300" in "Income".

In [176]:
frame['Income'].apply(lambda x:x/(100*3))

0    183.333333
1    133.333333
2     33.333333
3    200.000000
4      0.000000
5      0.000000
Name: Income, dtype: float64

* Now we can add this new column in our DataFrame

In [177]:
frame['Rating'] = frame['Income'].apply(lambda x:x/(100*3))

In [178]:
frame

,Name,Age,Profession,Income,Job Site,Experience,Residence,Rating
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A,183.333333
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong,133.333333
2,0,38,Insructor,10000,Gym,4,England,33.333333
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN,200.000000
4,Shafiq,58,0,0,Airport,8,France,0.000000
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN,0.000000

#### Example # 2:
* Now suppose I Have to check the minimum values b/w "Age" and "Rating"!
* And also remember this DataFrame is an example, and I am using it just to clear your thought!

In [179]:
frame[['Age','Rating']]

   Age      Rating
0   63  183.333333
1    0  133.333333
2   38   33.333333
3   45  200.000000
4   58    0.000000
5   29    0.000000

In [180]:
def func(row):
    if row['Age'] > row['Rating']:
        return row['Rating']
    else:
        return row['Age']

In [181]:
frame.apply(func,axis=1)

0    63.000000
1     0.000000
2    33.333333
3    45.000000
4     0.000000
5     0.000000
dtype: float64

## Filtering  Outliers
Outliers Meaning : An extremely high or extremely low data point relative to the nearest data point and the rest of the neighboring co-existing values in a data graph or dataset you're working with.

### Methods
There are two methods of filtering outliers

### Method #1: By the formula (Not a very Efficient Method!)

##### For Example:
Suppose There are 50 students in a class 48 students gets around 70 - 50 marks out of 100 as average, but the 49th one gets 2 marks and the 50th one gets 200 marks. Since both 49th and 50th get marks that are way ahead or way below the average marking then both considers as "Outliers"!

#### The Formula to filter "Outliers"

If the range of data is between "(Mean of the data) + 3(Standard deviation)" and "(Mean of the data) - 3(Standard deviation)" then it is not an outlier but if the range of data is exceeding or subceeding then it will count as an outlies!

In [182]:
frame

,Name,Age,Profession,Income,Job Site,Experience,Residence,Rating
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A,183.333333
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong,133.333333
2,0,38,Insructor,10000,Gym,4,England,33.333333
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN,200.000000
4,Shafiq,58,0,0,Airport,8,France,0.000000
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN,0.000000

* Now suppose if I want to check the outliers in "Income".

In [183]:
mean = frame['Income'].mean()
mean

27500.0

In [184]:
std = frame['Income'].std()
std

27522.71788904577

In [185]:
upper_range = mean + 3*std

In [186]:
lower_range = mean - 3*std

In [187]:
filtered_data = frame[frame['Income'] < upper_range][frame['Income'] > lower_range]
filtered_data

,Name,Age,Profession,Income,Job Site,Experience,Residence,Rating
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A,183.333333
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong,133.333333
2,0,38,Insructor,10000,Gym,4,England,33.333333
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN,200.000000
4,Shafiq,58,0,0,Airport,8,France,0.000000
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN,0.000000

### Method #2: By "describe()" (Efficient Method!)
As we know "discribe()" describes the whole DataFrame so it will be easier to detect the outliers by using "describe()"!

In [188]:
frame.describe()

             Age        Income  Experience      Rating
count   6.000000      6.000000    6.000000    6.000000
mean   38.833333  27500.000000    5.500000   91.666667
std    22.780840  27522.717889    3.449638   91.742393
min     0.000000      0.000000    0.000000    0.000000
25%    31.250000   2500.000000    4.250000    8.333333
50%    41.500000  25000.000000    5.500000   83.333333
75%    54.750000  51250.000000    7.500000  170.833333
max    63.000000  60000.000000   10.000000  200.000000

* If I want to check the outliers in "Income"
* These are the "outliers" as there income is less then 20000 which is far below the average income of others in the DataFrame!

In [189]:
frame[np.abs(frame['Income']<20000)]

,Name,Age,Profession,Income,Job Site,Experience,Residence,Rating
2,0,38,Insructor,10000,Gym,4,England,33.333333
4,Shafiq,58,0,0,Airport,8,France,0.000000
5,Danial,29,Racer,0,F1 Racing Arina,6,NaN,0.000000

#### Filtering The "Outliers" By "Capping"!
Capping is the method to give an average value of the entire column(in this case "Income") to the outliers so that they can stand by them! In the following line of code I am going to apply a where condition! Also I am not capping the mean of whole column to just make it as simple as possible.

In [190]:
frame['Income'] = np.where(frame['Income'] < 20000, 20000, frame['Income'])

In [191]:
frame

,Name,Age,Profession,Income,Job Site,Experience,Residence,Rating
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A,183.333333
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong,133.333333
2,0,38,Insructor,20000,Gym,4,England,33.333333
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN,200.000000
4,Shafiq,58,0,20000,Airport,8,France,0.000000
5,Danial,29,Racer,20000,F1 Racing Arina,6,NaN,0.000000

## Map
By "Map" we can add dictionary to an already created DataFrame!

##### For Example:
I want to add "Father Name" column in the "frame" but the values of the column lies in the dictionary then here using "Map Function" will be very usefull.

In [192]:
father_name = {
    'Kashif' : 'Hamid',
    'Moein' : 'Kareem',
    'Danial' : 'Rasheed',
    'Imran' : 'Bilal',
    'Shafiq' : 'Ashfaq',
    0 : 'Alex'
}

In [193]:
frame['Name'].map(father_name)

0      Hamid
1      Bilal
2        NaN
3     Kareem
4     Ashfaq
5    Rasheed
Name: Name, dtype: object

* Now we can this chart in our frame!

In [194]:
frame['Father Name']=frame['Name'].map(father_name)

In [195]:
frame

,Name,Age,Profession,Income,Job Site,Experience,Residence,Rating,Father Name
0,Kashif,63,Mechanical Engineer,55000,Freelancing,5,U.S.A,183.333333,Hamid
1,Imran,0,Constructor,40000,Shipyard,10,Hongkong,133.333333,Bilal
2,0,38,Insructor,20000,Gym,4,England,33.333333,NaN
3,Moein,45,Heart Surgeon,60000,Itly National Hospital,0,NaN,200.000000,Kareem
4,Shafiq,58,0,20000,Airport,8,France,0.000000,Ashfaq
5,Danial,29,Racer,20000,F1 Racing Arina,6,NaN,0.000000,Rasheed

In [196]:
frame = frame.reindex(['Name','Father Name','Age','Profession','Income','Job Site','Experience','Residence','Rating'], axis=1)
frame

,Name,Father Name,Age,Profession,Income,Job Site,Experience,Residence,Rating
0,Kashif,Hamid,63,Mechanical Engineer,55000,Freelancing,5,U.S.A,183.333333
1,Imran,Bilal,0,Constructor,40000,Shipyard,10,Hongkong,133.333333
2,0,NaN,38,Insructor,20000,Gym,4,England,33.333333
3,Moein,Kareem,45,Heart Surgeon,60000,Itly National Hospital,0,NaN,200.000000
4,Shafiq,Ashfaq,58,0,20000,Airport,8,France,0.000000
5,Danial,Rasheed,29,Racer,20000,F1 Racing Arina,6,NaN,0.000000

#### Applying conditions with "Map"
We can use map() funtion just like apply() function in some cases else they are both different!

#### Difference between "Map", "Applymap" and "Apply":
1. map() is a method of Series.
2. applymap() is a method of DataFrame.
3. apply() is defined in both DataFrame and Series.

In [197]:
frame['Experience'].map(lambda Experience: 'Low' if Experience<6 else 'Good')

0     Low
1    Good
2     Low
3     Low
4    Good
5    Good
Name: Experience, dtype: object

## Replace
* This function is use to replace the existing value of the "DataFrame"
* There are two methods of replace!

#### Method #1: By Dictionary

In [198]:
m = pd.DataFrame(
{
    'Id':[1023,1024,2106,8844],
    'Name':['Haseen','Shabbir','Kazim','Rahat'],
    'Age':[19,19,20,21]
})
m

     Id     Name  Age
0  1023   Haseen   19
1  1024  Shabbir   19
2  2106    Kazim   20
3  8844    Rahat   21

In [199]:
m['Id'].replace({
    2106:1025,
    8844:1026
},inplace=True)
m

     Id     Name  Age
0  1023   Haseen   19
1  1024  Shabbir   19
2  1025    Kazim   20
3  1026    Rahat   21

#### Method #2: By List

In [200]:
m['Name'].replace(['Haseen','Kazim'],['Arshad','Nazim'],inplace = True)
m

     Id     Name  Age
0  1023   Arshad   19
1  1024  Shabbir   19
2  1025    Nazim   20
3  1026    Rahat   21

## Discretization And Binning
##### Definition:
Discretization is the process of transforming a continuous-valued variable into a discrete one by creating a set of contiguous intervals (or equivalently a set of cutpoints) that spans the range of the variable's values.

##### For Example:
Suppose there are people of different ages in a line, and I am at the counter filling there information in the office computer!
As they are of different ages therefore it will be difficult for me to put the information at the right spot like, age less then 12 has to go in the child section, age less then 18 has to go in the teen section and .......
So by Discretization method the work will be much efficient. For each age group I just have to make a bin and then all the other work will be done by the machine it self!

In [201]:
ages = [9, 60 ,30 ,12 ,80 ,50 ,14 ,19 ,45 ,75 ,18]

In [202]:
bins = [6, 12, 18, 45, 60, 100]

* Now performing "Discretization" for which Pandas offers "cut()" function.

In [203]:
dis = pd.cut(ages, bins)
dis

[(6, 12], (45, 60], (18, 45], (6, 12], (60, 100], ..., (12, 18], (18, 45], (18, 45], (60, 100], (12, 18]]
Length: 11
Categories (5, interval[int64, right]): [(6, 12] < (12, 18] < (18, 45] < (45, 60] < (60, 100]]

##### Now let's see the code for each data and category

In [204]:
dis.codes

array([0, 3, 2, 0, 4, 3, 1, 2, 2, 4, 1], dtype=int8)

In [205]:
dis.categories

IntervalIndex([(6, 12], (12, 18], (18, 45], (45, 60], (60, 100]], dtype='interval[int64, right]')

##### What are the counts for each category?

In [206]:
pd.value_counts(dis)

(18, 45]     3
(6, 12]      2
(12, 18]     2
(45, 60]     2
(60, 100]    2
dtype: int64

#### Custom Labeling of a category
We can also customize the names of category to make things easier!

In [207]:
dis = pd.cut(ages, bins,labels=['Young', 'Teen', 'Adult', 'Middle Age', 'Old'])
dis

['Young', 'Middle Age', 'Adult', 'Young', 'Old', ..., 'Teen', 'Adult', 'Adult', 'Old', 'Teen']
Length: 11
Categories (5, object): ['Young' < 'Teen' < 'Adult' < 'Middle Age' < 'Old']

In [208]:
dis.categories

Index(['Young', 'Teen', 'Adult', 'Middle Age', 'Old'], dtype='object')

In [209]:
pd.value_counts(dis)

Adult         3
Young         2
Teen          2
Middle Age    2
Old           2
dtype: int64

## Combining and Merging Datasets

#### Joining Two DataFrame
It is similar to SQL joins . We join two Data Frame based on a common column!

In [210]:
df1 = pd.DataFrame({
    'Id' : [1,2,3],
    'Name' : ['Anwar','Khursheed','Rizwan']
})
df1

   Id       Name
0   1      Anwar
1   2  Khursheed
2   3     Rizwan

In [211]:
df2 = pd.DataFrame({
    'Id' : [1,2,3],
    'Age' : [23,33,45]
})
df2

   Id  Age
0   1   23
1   2   33
2   3   45

In [212]:
pd.merge(df1,df2)

   Id       Name  Age
0   1      Anwar   23
1   2  Khursheed   33
2   3     Rizwan   45

* When common Column name doesn't match! In this case we have to mention the right and left (which means that we have to tell the pandas that both ids are different!)
* This method is a type of "Join", wcich I will discuss later!

In [213]:
df3 = pd.DataFrame({
    'Emp_Id' : [1,2,3],
    'Age' : [23,33,45]
})
df3

   Emp_Id  Age
0       1   23
1       2   33
2       3   45

In [214]:
pd.merge(df1,df3, left_on='Id',right_on='Emp_Id')

   Id       Name  Emp_Id  Age
0   1      Anwar       1   23
1   2  Khursheed       2   33
2   3     Rizwan       3   45

### Types Of Joins
There are Four types of join in Pandas!
1. Right
2. Left
3. Inner
4. Outer
* The Inner join is the default one! So I am not going to talk about it.

#### 1. Right Join
Right Join means it will going to join two DataFrame by the right one!

##### Condition
If there are two dataframe with same ID but differ in size!
##### Disclaimer!!!
By condition I mean that in every type of join we can use any condition according to the need. Its not like, that if I use one condition to explain one join I can not use it in another type!

In [215]:
df2 = pd.DataFrame({
    'Id' : [1,2,3,4],
    'Age' : [23,33,45,70]
})
df2

   Id  Age
0   1   23
1   2   33
2   3   45
3   4   70

* To mention the type of Join we have to use "how" function!
* As you can see in the result of the code(which is written below) that while there is no 4th name in the first DataFrame but still pandas will count it as the 4th "NaN"

In [216]:
pd.merge(df1,df2,how='right')

   Id       Name  Age
0   1      Anwar   23
1   2  Khursheed   33
2   3     Rizwan   45
3   4        NaN   70

#### 2. Left Join
Since it is same as the right one the difference is, that its left! So I am not going to discribe it in details

In [217]:
pd.merge(df1,df2,how='left')

   Id       Name  Age
0   1      Anwar   23
1   2  Khursheed   33
2   3     Rizwan   45

#### 3. Outer Join

In [218]:
pd.merge(df1,df2,how='outer')

   Id       Name  Age
0   1      Anwar   23
1   2  Khursheed   33
2   3     Rizwan   45
3   4        NaN   70

## Merging Based on Index

In [219]:
p = pd.DataFrame({
    'Name' : ['Waleed', 'Mahmood', 'Rashid']
},index=[1,2,3])
p

      Name
1   Waleed
2  Mahmood
3   Rashid

* Just to be clear, I am going to merge "p" and "df1"

In [220]:
display(p)
display(df1)

      Name
1   Waleed
2  Mahmood
3   Rashid

   Id       Name
0   1      Anwar
1   2  Khursheed
2   3     Rizwan

* x and y mention in the result of codeline below is differenciating b/w both DataFrame!

In [221]:
pd.merge(df1,p,left_on= 'Id',right_index=True)

   Id     Name_x   Name_y
0   1      Anwar   Waleed
1   2  Khursheed  Mahmood
2   3     Rizwan   Rashid

## Concatenating Two DataFrames
It is similar to the concatenationin "Numpy"!

##### Disclaimer:
The concatination is not limited for two "DataFrames" only but can be done with many "DataFrames" at once! I am just giving an example by concatenatiing only two DataFrames!

In [222]:
d = pd.DataFrame(
{
    'Id':[42101,53880,26788],
    'Name':['Rashid','Qawi','Liaquat'],
    'Age':[22,24,21]
})
d

      Id     Name  Age
0  42101   Rashid   22
1  53880     Qawi   24
2  26788  Liaquat   21

In [223]:
d1 = pd.DataFrame(
{
    'Id':[31546,88833,42188],
    'Name':['Majid','Rafeeq','Kumar'],
    'Age':[21,25,20]
})
d1

      Id    Name  Age
0  31546   Majid   21
1  88833  Rafeeq   25
2  42188   Kumar   20

#### Row Wise:
It is by default!

In [224]:
pd.concat([d,d1])

      Id     Name  Age
0  42101   Rashid   22
1  53880     Qawi   24
2  26788  Liaquat   21
0  31546    Majid   21
1  88833   Rafeeq   25
2  42188    Kumar   20

#### Column Wise:
Is done Manually!

In [225]:
pd.concat([d,d1],axis=1)

      Id     Name  Age     Id    Name  Age
0  42101   Rashid   22  31546   Majid   21
1  53880     Qawi   24  88833  Rafeeq   25
2  26788  Liaquat   21  42188   Kumar   20

# This Was The Complete "Pandas"(Library)!
# I Have Tried My Best To Take It Step-by-step From The Very Beginning :)